---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.Clear
source: html/aed94a0e-d3de-d501-db0b-d80265f1b7e4.htm
---
# Autodesk.Revit.DB.ParameterMap.Clear Method

Removes every item from the map, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```